app/views/posts/index.html.erb

SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = $1  [["post_id", 4]]
---
   <div class="comment">
<% post.recent_five_comments.each do |comment| %>