app/views/posts/show.html.erb

   <div class="comment">
   <% @post.comments.each do |comment| %>
---
SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = $1  [["post_id", 1]]