app/controllers/comments_controller.rb

DELETE FROM "comments" WHERE "comments"."id" = $1  [["id", 2]]
---
  def destroy
    @post = Post.find(params[:post_id])
    @comment = Comment.find(params[:id])
    authorize! :destroy, @comment

    puts 'Authorization successful'

    if @comment.destroy