app/controllers/likes_controller.rb

INSERT INTO "likes" ("author_id", "post_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["author_id", 1], ["post_id", 20], ["created_at", "2023-05-19 08:42:48.286029"], ["updated_at", "2023-05-19 08:42:48.286029"]]
---
    def create
      @like = current_user.likes.new
      @like.post_id = params[:post_id]

      if @like.save