app/models/like.rb

  def update_like_counter
    post.increment!(:likes_counter)
---
UPDATE "posts" SET "likes_counter" = COALESCE("likes_counter", 0) + $1 WHERE "posts"."id" = $2  [["likes_counter", 1], ["id", 20]]